[
  {
    "Id": 1,
    "Name": "Founders Update",
    "Timestamp": "2020-02-07T18:40:00Z",
    "Notes": [
      "Added new items",
      "Added new rarity",
      "Added new faction",
      "Added new recipes (all founders recipes included)",
      "Updated/Checked all existing recipes",
      "Recipes resulting in more than one item now get calculated correctly (Wheels/Repair Kits)"
    ]
  },
  {
    "Id": 2,
    "Name": "Update",
    "Timestamp": "2020-02-11T16:38:00Z",
    "Notes": [
      "Added new Crafting Calculator",
      "Fixed Crafting Advice Calculation"
    ]
  },
  {
    "Id": 3,
    "Name": "Update",
    "Timestamp": "2020-02-13T14:42:00Z",
    "Notes": [
      "Added russian localization for item names -> Check the settings",
      "Added new items",
      "Added new pack"
    ]
  },
  {
    "Id": 4,
    "Name": "Doomsday Cars and Raven's Path Update",
    "Timestamp": "2020-06-06T10:00:00Z",
    "Notes": [
      "Added new items",
      "Added new packs",
      "Added new recipes",
      "Changed workbench costs"
    ]
  },
  {
    "Id": 5,
    "Name": "Update",
    "Timestamp": "2020-06-15T11:09:00Z",
    "Notes": [
      "Changed optimal route calculation. The optimal route now takes paths below \"buy\" advised ingredients into account. Big thanks to Anraton for providing code to solve this!",
      "Added snapshot feature to the crafting calculator. This allows you to save the current state of the calculator. Data is saved locally in your browsers web storage.",
      "Fixed an bug in the crafting calculator which caused unwanted expanding of similar items in the tree.",
      "Added health check endpoint to API v1 and v2 ( https://crossoutdb.com/api/v2/health ). Please use this endpoint if you want to check if the service is running.",
      "Updated localization table. New items should now also be available with russian localization."
    ]
  },
  {
    "Id": 6,
    "Name": "Update",
    "Timestamp": "2020-06-22T08:00:00Z",
    "Notes": [
      "Added faction icons to the crafting calculator.",
      "Updated/Added new high resolution images to item pages. Thanks to Maxim Zelenkin for providing the images!",
      "Optimized item chart data storage. Item charts should now load significantly faster.",
      "Added new API endpoint ( api/v2/marketrecent-all ). This endpoint uses the new market history storage. It contains the last 30 days of market data and is significantly faster.",
      "Added option to show the ID of items in the HTML Export table.",
      "Added option to show removed items in the HTML Export table. This setting should be used if you rely on the item order.",
      "Replaced changes page with info page ( https://crossoutdb.com/info ). Changes can still be found on the info page."
    ]
  },
  {
    "Id": 7,
    "Name": "Update",
    "Timestamp": "2020-07-01T15:00:00Z",
    "Notes": [
      "Added Badge Exchange draft page.",
      "Added Item Sniper draft page",
      "Fix filter options getting ignored when providing a search string to the items API endpoint",
      "Fix last price update time on info page not showing the correct date",
      "Fix chart not showing historic data for old/removed items"
    ]
  },
  {
    "Id": 8,
    "Name": "Steel Championship Update",
    "Timestamp": "2020-07-06T08:00:00Z",
    "Notes": [
      "Added new items",
      "Added salvager tool page",
      "Renamed 'Drafts' to 'Tools'",
      "Renamed 'Community Tools' to 'Community Links'",
      "Fixed badge exchange incorrectly showing outdated warning",
      "Fixed ammo box decimals",
      "Fixed chart titles not getting displayed correctly",
      "Disabled old crafting calculator"
    ]
  }
]